zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT735S/MIMXRT735S_hifi1_COMMON.h
/* GPIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral GPIO8 base address */
  #define GPIO8_BASE                               (0x50320000u)
  /** Peripheral GPIO8 base address */
  #define GPIO8_BASE_NS                            (0x40320000u)
  /** Peripheral GPIO8 base pointer */
  #define GPIO8                                    ((GPIO_Type *)GPIO8_BASE)
  /** Peripheral GPIO8 base pointer */
  #define GPIO8_NS                                 ((GPIO_Type *)GPIO8_BASE_NS)
  /** Peripheral GPIO9 base address */
  #define GPIO9_BASE                               (0x50322000u)
  /** Peripheral GPIO9 base address */
  #define GPIO9_BASE_NS                            (0x40322000u)
  /** Peripheral GPIO9 base pointer */
  #define GPIO9                                    ((GPIO_Type *)GPIO9_BASE)
  /** Peripheral GPIO9 base pointer */
  #define GPIO9_NS                                 ((GPIO_Type *)GPIO9_BASE_NS)
  /** Peripheral GPIO10 base address */
  #define GPIO10_BASE                              (0x50324000u)
  /** Peripheral GPIO10 base address */
  #define GPIO10_BASE_NS                           (0x40324000u)
  /** Peripheral GPIO10 base pointer */
  #define GPIO10                                   ((GPIO_Type *)GPIO10_BASE)
  /** Peripheral GPIO10 base pointer */
  #define GPIO10_NS                                ((GPIO_Type *)GPIO10_BASE_NS)
  /** Peripheral GPIO8_ALIAS base address */
  #define GPIO8_ALIAS_BASE                         (0x50321000u)
  /** Peripheral GPIO8_ALIAS base address */
  #define GPIO8_ALIAS_BASE_NS                      (0x40321000u)
  /** Peripheral GPIO8_ALIAS base pointer */
  #define GPIO8_ALIAS                              ((GPIO_Type *)GPIO8_ALIAS_BASE)
  /** Peripheral GPIO8_ALIAS base pointer */
  #define GPIO8_ALIAS_NS                           ((GPIO_Type *)GPIO8_ALIAS_BASE_NS)
  /** Peripheral GPIO9_ALIAS base address */
  #define GPIO9_ALIAS_BASE                         (0x50323000u)
  /** Peripheral GPIO9_ALIAS base address */
  #define GPIO9_ALIAS_BASE_NS                      (0x40323000u)
  /** Peripheral GPIO9_ALIAS base pointer */
  #define GPIO9_ALIAS                              ((GPIO_Type *)GPIO9_ALIAS_BASE)
  /** Peripheral GPIO9_ALIAS base pointer */
  #define GPIO9_ALIAS_NS                           ((GPIO_Type *)GPIO9_ALIAS_BASE_NS)
  /** Peripheral GPIO10_ALIAS base address */
  #define GPIO10_ALIAS_BASE                        (0x50325000u)
  /** Peripheral GPIO10_ALIAS base address */
  #define GPIO10_ALIAS_BASE_NS                     (0x40325000u)
  /** Peripheral GPIO10_ALIAS base pointer */
  #define GPIO10_ALIAS                             ((GPIO_Type *)GPIO10_ALIAS_BASE)
  /** Peripheral GPIO10_ALIAS base pointer */
  #define GPIO10_ALIAS_NS                          ((GPIO_Type *)GPIO10_ALIAS_BASE_NS)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, GPIO8_BASE, GPIO9_BASE, GPIO10_BASE, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, GPIO8_ALIAS_BASE, GPIO9_ALIAS_BASE, GPIO10_ALIAS_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO8, GPIO9, GPIO10, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO8_ALIAS, GPIO9_ALIAS, GPIO10_ALIAS }
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS_NS                       { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, GPIO8_BASE_NS, GPIO9_BASE_NS, GPIO10_BASE_NS, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, GPIO8_ALIAS_BASE_NS, GPIO9_ALIAS_BASE_NS, GPIO10_ALIAS_BASE_NS }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS_NS                        { (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO8_NS, GPIO9_NS, GPIO10_NS, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO8_ALIAS_NS, GPIO9_ALIAS_NS, GPIO10_ALIAS_NS }
#else
  /** Peripheral GPIO8 base address */
  #define GPIO8_BASE                               (0x40320000u)
  /** Peripheral GPIO8 base pointer */
  #define GPIO8                                    ((GPIO_Type *)GPIO8_BASE)
  /** Peripheral GPIO9 base address */
  #define GPIO9_BASE                               (0x40322000u)
  /** Peripheral GPIO9 base pointer */
  #define GPIO9                                    ((GPIO_Type *)GPIO9_BASE)
  /** Peripheral GPIO10 base address */
  #define GPIO10_BASE                              (0x40324000u)
  /** Peripheral GPIO10 base pointer */
  #define GPIO10                                   ((GPIO_Type *)GPIO10_BASE)
  /** Peripheral GPIO8_ALIAS base address */
  #define GPIO8_ALIAS_BASE                         (0x40321000u)
  /** Peripheral GPIO8_ALIAS base pointer */
  #define GPIO8_ALIAS                              ((GPIO_Type *)GPIO8_ALIAS_BASE)
  /** Peripheral GPIO9_ALIAS base address */
  #define GPIO9_ALIAS_BASE                         (0x40323000u)
  /** Peripheral GPIO9_ALIAS base pointer */
  #define GPIO9_ALIAS                              ((GPIO_Type *)GPIO9_ALIAS_BASE)
  /** Peripheral GPIO10_ALIAS base address */
  #define GPIO10_ALIAS_BASE                        (0x40325000u)
  /** Peripheral GPIO10_ALIAS base pointer */
  #define GPIO10_ALIAS                             ((GPIO_Type *)GPIO10_ALIAS_BASE)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, GPIO8_BASE, GPIO9_BASE, GPIO10_BASE, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, GPIO8_ALIAS_BASE, GPIO9_ALIAS_BASE, GPIO10_ALIAS_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO8, GPIO9, GPIO10, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO8_ALIAS, GPIO9_ALIAS, GPIO10_ALIAS }
#endif
/* Interrupt vectors for the GPIO peripheral type */


/* I2S - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SAI3 base address */
  #define SAI3_BASE                                (0x5031C000u)
  /** Peripheral SAI3 base address */
  #define SAI3_BASE_NS                             (0x4031C000u)
  /** Peripheral SAI3 base pointer */
  #define SAI3                                     ((I2S_Type *)SAI3_BASE)
  /** Peripheral SAI3 base pointer */
  #define SAI3_NS                                  ((I2S_Type *)SAI3_BASE_NS)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { 0u, 0u, 0u, SAI3_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { (I2S_Type *)0u, (I2S_Type *)0u, (I2S_Type *)0u, SAI3 }
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS_NS                        { 0u, 0u, 0u, SAI3_BASE_NS }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS_NS                         { (I2S_Type *)0u, (I2S_Type *)0u, (I2S_Type *)0u, SAI3_NS }
#else
  /** Peripheral SAI3 base address */
  #define SAI3_BASE                                (0x4031C000u)
  /** Peripheral SAI3 base pointer */
  #define SAI3                                     ((I2S_Type *)SAI3_BASE)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { 0u, 0u, 0u, SAI3_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { (I2S_Type *)0u, (I2S_Type *)0u, (I2S_Type *)0u, SAI3 }
#endif
/** Interrupt vectors for the I2S peripheral type */
#define I2S_RX_IRQS                              { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, SAI3_TX_RX_IRQn }
#define I2S_TX_IRQS                              { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, SAI3_TX_RX_IRQn }

/* I3C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral I3C2 base address */
  #define I3C2_BASE                                (0x50056000u)
  /** Peripheral I3C2 base address */
  #define I3C2_BASE_NS                             (0x40056000u)
  /** Peripheral I3C2 base pointer */
  #define I3C2                                     ((I3C_Type *)I3C2_BASE)
  /** Peripheral I3C2 base pointer */
  #define I3C2_NS                                  ((I3C_Type *)I3C2_BASE_NS)
  /** Peripheral I3C3 base address */
  #define I3C3_BASE                                (0x50057000u)
  /** Peripheral I3C3 base address */
  #define I3C3_BASE_NS                             (0x40057000u)
  /** Peripheral I3C3 base pointer */
  #define I3C3                                     ((I3C_Type *)I3C3_BASE)
  /** Peripheral I3C3 base pointer */
  #define I3C3_NS                                  ((I3C_Type *)I3C3_BASE_NS)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { 0u, 0u, I3C2_BASE, I3C3_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { (I3C_Type *)0u, (I3C_Type *)0u, I3C2, I3C3 }
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS_NS                        { 0u, 0u, I3C2_BASE_NS, I3C3_BASE_NS }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS_NS                         { (I3C_Type *)0u, (I3C_Type *)0u, I3C2_NS, I3C3_NS }
#else
  /** Peripheral I3C2 base address */
  #define I3C2_BASE                                (0x40056000u)
  /** Peripheral I3C2 base pointer */
  #define I3C2                                     ((I3C_Type *)I3C2_BASE)
  /** Peripheral I3C3 base address */
  #define I3C3_BASE                                (0x40057000u)
  /** Peripheral I3C3 base pointer */
  #define I3C3                                     ((I3C_Type *)I3C3_BASE)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { 0u, 0u, I3C2_BASE, I3C3_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { (I3C_Type *)0u, (I3C_Type *)0u, I3C2, I3C3 }
#endif
/** Interrupt vectors for the I3C peripheral type */
#define I3C_IRQS                                 { NotAvail_IRQn, NotAvail_IRQn, I3C2_IRQn, I3C3_IRQn }

/* INPUTMUX1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral INPUTMUX1 base address */
  #define INPUTMUX1_BASE                           (0x50046000u)
  /** Peripheral INPUTMUX1 base address */
  #define INPUTMUX1_BASE_NS                        (0x40046000u)
  /** Peripheral INPUTMUX1 base pointer */
  #define INPUTMUX1                                ((INPUTMUX1_Type *)INPUTMUX1_BASE)
  /** Peripheral INPUTMUX1 base pointer */
  #define INPUTMUX1_NS                             ((INPUTMUX1_Type *)INPUTMUX1_BASE_NS)
  /** Array initializer of INPUTMUX1 peripheral base addresses */
  #define INPUTMUX1_BASE_ADDRS                     { INPUTMUX1_BASE }
  /** Array initializer of INPUTMUX1 peripheral base pointers */
  #define INPUTMUX1_BASE_PTRS                      { INPUTMUX1 }
  /** Array initializer of INPUTMUX1 peripheral base addresses */
  #define INPUTMUX1_BASE_ADDRS_NS                  { INPUTMUX1_BASE_NS }
  /** Array initializer of INPUTMUX1 peripheral base pointers */
  #define INPUTMUX1_BASE_PTRS_NS                   { INPUTMUX1_NS }
#else
  /** Peripheral INPUTMUX1 base address */
  #define INPUTMUX1_BASE                           (0x40046000u)
  /** Peripheral INPUTMUX1 base pointer */
  #define INPUTMUX1                                ((INPUTMUX1_Type *)INPUTMUX1_BASE)
  /** Array initializer of INPUTMUX1 peripheral base addresses */
  #define INPUTMUX1_BASE_ADDRS                     { INPUTMUX1_BASE }
  /** Array initializer of INPUTMUX1 peripheral base pointers */
  #define INPUTMUX1_BASE_PTRS                      { INPUTMUX1 }
#endif
/** INPUTMUX extra definition */
#define INPUTMUX_Type INPUTMUX1_Type
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
#define INPUTMUX_BASE_ADDRS INPUTMUX1_BASE_ADDRS
#define INPUTMUX_BASE_PTRS INPUTMUX1_BASE_PTRS
#define INPUTMUX_BASE_ADDRS_NS INPUTMUX1_BASE_ADDRS_NS
#define INPUTMUX_BASE_PTRS_NS INPUTMUX1_BASE_PTRS_NS
#else
#define INPUTMUX_BASE_ADDRS INPUTMUX1_BASE_ADDRS
#define INPUTMUX_BASE_PTRS INPUTMUX1_BASE_PTRS
#endif


/* IOPCTL1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IOPCTL1 base address */
  #define IOPCTL1_BASE                             (0x50064000u)
  /** Peripheral IOPCTL1 base address */
  #define IOPCTL1_BASE_NS                          (0x40064000u)
  /** Peripheral IOPCTL1 base pointer */
  #define IOPCTL1                                  ((IOPCTL1_Type *)IOPCTL1_BASE)
  /** Peripheral IOPCTL1 base pointer */
  #define IOPCTL1_NS                               ((IOPCTL1_Type *)IOPCTL1_BASE_NS)
  /** Array initializer of IOPCTL1 peripheral base addresses */
  #define IOPCTL1_BASE_ADDRS                       { IOPCTL1_BASE }
  /** Array initializer of IOPCTL1 peripheral base pointers */
  #define IOPCTL1_BASE_PTRS                        { IOPCTL1 }
  /** Array initializer of IOPCTL1 peripheral base addresses */
  #define IOPCTL1_BASE_ADDRS_NS                    { IOPCTL1_BASE_NS }
  /** Array initializer of IOPCTL1 peripheral base pointers */
  #define IOPCTL1_BASE_PTRS_NS                     { IOPCTL1_NS }
#else
  /** Peripheral IOPCTL1 base address */
  #define IOPCTL1_BASE                             (0x40064000u)
  /** Peripheral IOPCTL1 base pointer */
  #define IOPCTL1                                  ((IOPCTL1_Type *)IOPCTL1_BASE)
  /** Array initializer of IOPCTL1 peripheral base addresses */
  #define IOPCTL1_BASE_ADDRS                       { IOPCTL1_BASE }
  /** Array initializer of IOPCTL1 peripheral base pointers */
  #define IOPCTL1_BASE_PTRS                        { IOPCTL1 }
#endif

/* IOPCTL2 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IOPCTL2 base address */
  #define IOPCTL2_BASE                             (0x500A5000u)
  /** Peripheral IOPCTL2 base address */
  #define IOPCTL2_BASE_NS                          (0x400A5000u)
  /** Peripheral IOPCTL2 base pointer */
  #define IOPCTL2                                  ((IOPCTL2_Type *)IOPCTL2_BASE)
  /** Peripheral IOPCTL2 base pointer */
  #define IOPCTL2_NS                               ((IOPCTL2_Type *)IOPCTL2_BASE_NS)
  /** Array initializer of IOPCTL2 peripheral base addresses */
  #define IOPCTL2_BASE_ADDRS                       { IOPCTL2_BASE }
  /** Array initializer of IOPCTL2 peripheral base pointers */
  #define IOPCTL2_BASE_PTRS                        { IOPCTL2 }
  /** Array initializer of IOPCTL2 peripheral base addresses */
  #define IOPCTL2_BASE_ADDRS_NS                    { IOPCTL2_BASE_NS }
  /** Array initializer of IOPCTL2 peripheral base pointers */
  #define IOPCTL2_BASE_PTRS_NS                     { IOPCTL2_NS }
#else
  /** Peripheral IOPCTL2 base address */
  #define IOPCTL2_BASE                             (0x400A5000u)
  /** Peripheral IOPCTL2 base pointer */
  #define IOPCTL2                                  ((IOPCTL2_Type *)IOPCTL2_BASE)
  /** Array initializer of IOPCTL2 peripheral base addresses */
  #define IOPCTL2_BASE_ADDRS                       { IOPCTL2_BASE }
  /** Array initializer of IOPCTL2 peripheral base pointers */
  #define IOPCTL2_BASE_PTRS                        { IOPCTL2 }
#endif
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
/** Array initializer of IOPCTL peripheral base addresses */
  #define IOPCTL_BASE_ADDRS                        {0u, IOPCTL1_BASE, IOPCTLR2_BASE}
/** Array initializer of IOPCTL NS peripheral base addresses */
  #define IOPCTL_BASE_ADDRS_NS                     {0u, IOPCTL1_BASE_NS, IOPCTLR2_BASE_NS}
#else
/** Array initializer of IOPCTL peripheral base addresses */
  #define IOPCTL_BASE_ADDRS                        {0u, IOPCTL1_BASE, IOPCTLR2_BASE}
#endif


/* JPGDECWRP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral JPGDECWRP base address */
  #define JPGDECWRP_BASE                           (0x500A6000u)
  /** Peripheral JPGDECWRP base address */
  #define JPGDECWRP_BASE_NS                        (0x400A6000u)
  /** Peripheral JPGDECWRP base pointer */
  #define JPGDECWRP                                ((JPGDECWRP_Type *)JPGDECWRP_BASE)
  /** Peripheral JPGDECWRP base pointer */
  #define JPGDECWRP_NS                             ((JPGDECWRP_Type *)JPGDECWRP_BASE_NS)
  /** Array initializer of JPGDECWRP peripheral base addresses */
  #define JPGDECWRP_BASE_ADDRS                     { JPGDECWRP_BASE }
  /** Array initializer of JPGDECWRP peripheral base pointers */
  #define JPGDECWRP_BASE_PTRS                      { JPGDECWRP }
  /** Array initializer of JPGDECWRP peripheral base addresses */
  #define JPGDECWRP_BASE_ADDRS_NS                  { JPGDECWRP_BASE_NS }
  /** Array initializer of JPGDECWRP peripheral base pointers */
  #define JPGDECWRP_BASE_PTRS_NS                   { JPGDECWRP_NS }
#else
  /** Peripheral JPGDECWRP base address */
  #define JPGDECWRP_BASE                           (0x400A6000u)
  /** Peripheral JPGDECWRP base pointer */
  #define JPGDECWRP                                ((JPGDECWRP_Type *)JPGDECWRP_BASE)
  /** Array initializer of JPGDECWRP peripheral base addresses */
  #define JPGDECWRP_BASE_ADDRS                     { JPGDECWRP_BASE }
  /** Array initializer of JPGDECWRP peripheral base pointers */
  #define JPGDECWRP_BASE_PTRS                      { JPGDECWRP }
#endif

