zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT735S/MIMXRT735S_hifi1_COMMON.h
/* LPI2C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPI2C15 base address */
  #define LPI2C15_BASE                             (0x50213000u)
  /** Peripheral LPI2C15 base address */
  #define LPI2C15_BASE_NS                          (0x40213000u)
  /** Peripheral LPI2C15 base pointer */
  #define LPI2C15                                  ((LPI2C_Type *)LPI2C15_BASE)
  /** Peripheral LPI2C15 base pointer */
  #define LPI2C15_NS                               ((LPI2C_Type *)LPI2C15_BASE_NS)
  /** Peripheral LPI2C17 base address */
  #define LPI2C17_BASE                             (0x50326800u)
  /** Peripheral LPI2C17 base address */
  #define LPI2C17_BASE_NS                          (0x40326800u)
  /** Peripheral LPI2C17 base pointer */
  #define LPI2C17                                  ((LPI2C_Type *)LPI2C17_BASE)
  /** Peripheral LPI2C17 base pointer */
  #define LPI2C17_NS                               ((LPI2C_Type *)LPI2C17_BASE_NS)
  /** Peripheral LPI2C18 base address */
  #define LPI2C18_BASE                             (0x50327800u)
  /** Peripheral LPI2C18 base address */
  #define LPI2C18_BASE_NS                          (0x40327800u)
  /** Peripheral LPI2C18 base pointer */
  #define LPI2C18                                  ((LPI2C_Type *)LPI2C18_BASE)
  /** Peripheral LPI2C18 base pointer */
  #define LPI2C18_NS                               ((LPI2C_Type *)LPI2C18_BASE_NS)
  /** Peripheral LPI2C19 base address */
  #define LPI2C19_BASE                             (0x50328800u)
  /** Peripheral LPI2C19 base address */
  #define LPI2C19_BASE_NS                          (0x40328800u)
  /** Peripheral LPI2C19 base pointer */
  #define LPI2C19                                  ((LPI2C_Type *)LPI2C19_BASE)
  /** Peripheral LPI2C19 base pointer */
  #define LPI2C19_NS                               ((LPI2C_Type *)LPI2C19_BASE_NS)
  /** Peripheral LPI2C20 base address */
  #define LPI2C20_BASE                             (0x50329800u)
  /** Peripheral LPI2C20 base address */
  #define LPI2C20_BASE_NS                          (0x40329800u)
  /** Peripheral LPI2C20 base pointer */
  #define LPI2C20                                  ((LPI2C_Type *)LPI2C20_BASE)
  /** Peripheral LPI2C20 base pointer */
  #define LPI2C20_NS                               ((LPI2C_Type *)LPI2C20_BASE_NS)
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS                         { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPI2C15_BASE, 0u, LPI2C17_BASE, LPI2C18_BASE, LPI2C19_BASE, LPI2C20_BASE }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS                          { (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, LPI2C15, (LPI2C_Type *)0u, LPI2C17, LPI2C18, LPI2C19, LPI2C20 }
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS_NS                      { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPI2C15_BASE_NS, 0u, LPI2C17_BASE_NS, LPI2C18_BASE_NS, LPI2C19_BASE_NS, LPI2C20_BASE_NS }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS_NS                       { (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, LPI2C15_NS, (LPI2C_Type *)0u, LPI2C17_NS, LPI2C18_NS, LPI2C19_NS, LPI2C20_NS }
#else
  /** Peripheral LPI2C15 base address */
  #define LPI2C15_BASE                             (0x40213000u)
  /** Peripheral LPI2C15 base pointer */
  #define LPI2C15                                  ((LPI2C_Type *)LPI2C15_BASE)
  /** Peripheral LPI2C17 base address */
  #define LPI2C17_BASE                             (0x40326800u)
  /** Peripheral LPI2C17 base pointer */
  #define LPI2C17                                  ((LPI2C_Type *)LPI2C17_BASE)
  /** Peripheral LPI2C18 base address */
  #define LPI2C18_BASE                             (0x40327800u)
  /** Peripheral LPI2C18 base pointer */
  #define LPI2C18                                  ((LPI2C_Type *)LPI2C18_BASE)
  /** Peripheral LPI2C19 base address */
  #define LPI2C19_BASE                             (0x40328800u)
  /** Peripheral LPI2C19 base pointer */
  #define LPI2C19                                  ((LPI2C_Type *)LPI2C19_BASE)
  /** Peripheral LPI2C20 base address */
  #define LPI2C20_BASE                             (0x40329800u)
  /** Peripheral LPI2C20 base pointer */
  #define LPI2C20                                  ((LPI2C_Type *)LPI2C20_BASE)
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS                         { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPI2C15_BASE, 0u, LPI2C17_BASE, LPI2C18_BASE, LPI2C19_BASE, LPI2C20_BASE }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS                          { (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, (LPI2C_Type *)0u, LPI2C15, (LPI2C_Type *)0u, LPI2C17, LPI2C18, LPI2C19, LPI2C20 }
#endif
/** Interrupt vectors for the LPI2C peripheral type */
#define LPI2C_IRQS                               { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, LP_FLEXCOMM17_IRQn, LP_FLEXCOMM18_IRQn, LP_FLEXCOMM19_IRQn, LP_FLEXCOMM20_IRQn }

/* LPSPI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPSPI14 base address */
  #define LPSPI14_BASE                             (0x50484000u)
  /** Peripheral LPSPI14 base address */
  #define LPSPI14_BASE_NS                          (0x40484000u)
  /** Peripheral LPSPI14 base pointer */
  #define LPSPI14                                  ((LPSPI_Type *)LPSPI14_BASE)
  /** Peripheral LPSPI14 base pointer */
  #define LPSPI14_NS                               ((LPSPI_Type *)LPSPI14_BASE_NS)
  /** Peripheral LPSPI16 base address */
  #define LPSPI16_BASE                             (0x50405000u)
  /** Peripheral LPSPI16 base address */
  #define LPSPI16_BASE_NS                          (0x40405000u)
  /** Peripheral LPSPI16 base pointer */
  #define LPSPI16                                  ((LPSPI_Type *)LPSPI16_BASE)
  /** Peripheral LPSPI16 base pointer */
  #define LPSPI16_NS                               ((LPSPI_Type *)LPSPI16_BASE_NS)
  /** Peripheral LPSPI17 base address */
  #define LPSPI17_BASE                             (0x50326000u)
  /** Peripheral LPSPI17 base address */
  #define LPSPI17_BASE_NS                          (0x40326000u)
  /** Peripheral LPSPI17 base pointer */
  #define LPSPI17                                  ((LPSPI_Type *)LPSPI17_BASE)
  /** Peripheral LPSPI17 base pointer */
  #define LPSPI17_NS                               ((LPSPI_Type *)LPSPI17_BASE_NS)
  /** Peripheral LPSPI18 base address */
  #define LPSPI18_BASE                             (0x50327000u)
  /** Peripheral LPSPI18 base address */
  #define LPSPI18_BASE_NS                          (0x40327000u)
  /** Peripheral LPSPI18 base pointer */
  #define LPSPI18                                  ((LPSPI_Type *)LPSPI18_BASE)
  /** Peripheral LPSPI18 base pointer */
  #define LPSPI18_NS                               ((LPSPI_Type *)LPSPI18_BASE_NS)
  /** Peripheral LPSPI19 base address */
  #define LPSPI19_BASE                             (0x50328000u)
  /** Peripheral LPSPI19 base address */
  #define LPSPI19_BASE_NS                          (0x40328000u)
  /** Peripheral LPSPI19 base pointer */
  #define LPSPI19                                  ((LPSPI_Type *)LPSPI19_BASE)
  /** Peripheral LPSPI19 base pointer */
  #define LPSPI19_NS                               ((LPSPI_Type *)LPSPI19_BASE_NS)
  /** Peripheral LPSPI20 base address */
  #define LPSPI20_BASE                             (0x50329000u)
  /** Peripheral LPSPI20 base address */
  #define LPSPI20_BASE_NS                          (0x40329000u)
  /** Peripheral LPSPI20 base pointer */
  #define LPSPI20                                  ((LPSPI_Type *)LPSPI20_BASE)
  /** Peripheral LPSPI20 base pointer */
  #define LPSPI20_NS                               ((LPSPI_Type *)LPSPI20_BASE_NS)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPSPI14_BASE, 0u, LPSPI16_BASE, LPSPI17_BASE, LPSPI18_BASE, LPSPI19_BASE, LPSPI20_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, LPSPI14, (LPSPI_Type *)0u, LPSPI16, LPSPI17, LPSPI18, LPSPI19, LPSPI20 }
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS_NS                      { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPSPI14_BASE_NS, 0u, LPSPI16_BASE_NS, LPSPI17_BASE_NS, LPSPI18_BASE_NS, LPSPI19_BASE_NS, LPSPI20_BASE_NS }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS_NS                       { (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, LPSPI14_NS, (LPSPI_Type *)0u, LPSPI16_NS, LPSPI17_NS, LPSPI18_NS, LPSPI19_NS, LPSPI20_NS }
#else
  /** Peripheral LPSPI14 base address */
  #define LPSPI14_BASE                             (0x40484000u)
  /** Peripheral LPSPI14 base pointer */
  #define LPSPI14                                  ((LPSPI_Type *)LPSPI14_BASE)
  /** Peripheral LPSPI16 base address */
  #define LPSPI16_BASE                             (0x40405000u)
  /** Peripheral LPSPI16 base pointer */
  #define LPSPI16                                  ((LPSPI_Type *)LPSPI16_BASE)
  /** Peripheral LPSPI17 base address */
  #define LPSPI17_BASE                             (0x40326000u)
  /** Peripheral LPSPI17 base pointer */
  #define LPSPI17                                  ((LPSPI_Type *)LPSPI17_BASE)
  /** Peripheral LPSPI18 base address */
  #define LPSPI18_BASE                             (0x40327000u)
  /** Peripheral LPSPI18 base pointer */
  #define LPSPI18                                  ((LPSPI_Type *)LPSPI18_BASE)
  /** Peripheral LPSPI19 base address */
  #define LPSPI19_BASE                             (0x40328000u)
  /** Peripheral LPSPI19 base pointer */
  #define LPSPI19                                  ((LPSPI_Type *)LPSPI19_BASE)
  /** Peripheral LPSPI20 base address */
  #define LPSPI20_BASE                             (0x40329000u)
  /** Peripheral LPSPI20 base pointer */
  #define LPSPI20                                  ((LPSPI_Type *)LPSPI20_BASE)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPSPI14_BASE, 0u, LPSPI16_BASE, LPSPI17_BASE, LPSPI18_BASE, LPSPI19_BASE, LPSPI20_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, LPSPI14, (LPSPI_Type *)0u, LPSPI16, LPSPI17, LPSPI18, LPSPI19, LPSPI20 }
#endif
/** Interrupt vectors for the LPSPI peripheral type */
#define LPSPI_IRQS                               { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, LP_FLEXCOMM17_IRQn, LP_FLEXCOMM18_IRQn, LP_FLEXCOMM19_IRQn, LP_FLEXCOMM20_IRQn }

/* LPUART - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPUART17 base address */
  #define LPUART17_BASE                            (0x50326000u)
  /** Peripheral LPUART17 base address */
  #define LPUART17_BASE_NS                         (0x40326000u)
  /** Peripheral LPUART17 base pointer */
  #define LPUART17                                 ((LPUART_Type *)LPUART17_BASE)
  /** Peripheral LPUART17 base pointer */
  #define LPUART17_NS                              ((LPUART_Type *)LPUART17_BASE_NS)
  /** Peripheral LPUART18 base address */
  #define LPUART18_BASE                            (0x50327000u)
  /** Peripheral LPUART18 base address */
  #define LPUART18_BASE_NS                         (0x40327000u)
  /** Peripheral LPUART18 base pointer */
  #define LPUART18                                 ((LPUART_Type *)LPUART18_BASE)
  /** Peripheral LPUART18 base pointer */
  #define LPUART18_NS                              ((LPUART_Type *)LPUART18_BASE_NS)
  /** Peripheral LPUART19 base address */
  #define LPUART19_BASE                            (0x50328000u)
  /** Peripheral LPUART19 base address */
  #define LPUART19_BASE_NS                         (0x40328000u)
  /** Peripheral LPUART19 base pointer */
  #define LPUART19                                 ((LPUART_Type *)LPUART19_BASE)
  /** Peripheral LPUART19 base pointer */
  #define LPUART19_NS                              ((LPUART_Type *)LPUART19_BASE_NS)
  /** Peripheral LPUART20 base address */
  #define LPUART20_BASE                            (0x50329000u)
  /** Peripheral LPUART20 base address */
  #define LPUART20_BASE_NS                         (0x40329000u)
  /** Peripheral LPUART20 base pointer */
  #define LPUART20                                 ((LPUART_Type *)LPUART20_BASE)
  /** Peripheral LPUART20 base pointer */
  #define LPUART20_NS                              ((LPUART_Type *)LPUART20_BASE_NS)
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS                        { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPUART17_BASE, LPUART18_BASE, LPUART19_BASE, LPUART20_BASE }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS                         { (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, LPUART17, LPUART18, LPUART19, LPUART20 }
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS_NS                     { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPUART17_BASE_NS, LPUART18_BASE_NS, LPUART19_BASE_NS, LPUART20_BASE_NS }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS_NS                      { (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, LPUART17_NS, LPUART18_NS, LPUART19_NS, LPUART20_NS }
#else
  /** Peripheral LPUART17 base address */
  #define LPUART17_BASE                            (0x40326000u)
  /** Peripheral LPUART17 base pointer */
  #define LPUART17                                 ((LPUART_Type *)LPUART17_BASE)
  /** Peripheral LPUART18 base address */
  #define LPUART18_BASE                            (0x40327000u)
  /** Peripheral LPUART18 base pointer */
  #define LPUART18                                 ((LPUART_Type *)LPUART18_BASE)
  /** Peripheral LPUART19 base address */
  #define LPUART19_BASE                            (0x40328000u)
  /** Peripheral LPUART19 base pointer */
  #define LPUART19                                 ((LPUART_Type *)LPUART19_BASE)
  /** Peripheral LPUART20 base address */
  #define LPUART20_BASE                            (0x40329000u)
  /** Peripheral LPUART20 base pointer */
  #define LPUART20                                 ((LPUART_Type *)LPUART20_BASE)
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS                        { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPUART17_BASE, LPUART18_BASE, LPUART19_BASE, LPUART20_BASE }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS                         { (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, (LPUART_Type *)0u, LPUART17, LPUART18, LPUART19, LPUART20 }
#endif
/** Interrupt vectors for the LPUART peripheral type */
#define LPUART_RX_TX_IRQS                        { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, LP_FLEXCOMM17_IRQn, LP_FLEXCOMM18_IRQn, LP_FLEXCOMM19_IRQn, LP_FLEXCOMM20_IRQn }
#define LPUART_ERR_IRQS                          { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, LP_FLEXCOMM17_IRQn, LP_FLEXCOMM18_IRQn, LP_FLEXCOMM19_IRQn, LP_FLEXCOMM20_IRQn }

